## Terraform Plan - `hjemmeprosjekt` 📋

<details>
<summary>Show Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.rbac.azurerm_role_assignment.basic["0"] will be imported
    resource "azurerm_role_assignment" "basic" {
        condition                              = null
        condition_version                      = null
        delegated_managed_identity_resource_id = null
        description                            = null
        id                                     = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9/providers/Microsoft.Authorization/roleAssignments/0beaa93a-97a8-4ea7-8773-3a1c67573471"
        name                                   = "0beaa93a-97a8-4ea7-8773-3a1c67573471"
        principal_id                           = "b4f1b858-69b7-4783-9103-2eb015417f96"
        principal_type                         = "ServicePrincipal"
        role_definition_id                     = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c"
        role_definition_name                   = "Contributor"
        scope                                  = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9"
    }

  # module.rbac.azurerm_role_assignment.basic["1"] will be imported
    resource "azurerm_role_assignment" "basic" {
        condition                              = null
        condition_version                      = null
        delegated_managed_identity_resource_id = null
        description                            = null
        id                                     = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9/providers/Microsoft.Authorization/roleAssignments/ef1f3071-31a4-4c04-ad37-f89ba8a25569"
        name                                   = "ef1f3071-31a4-4c04-ad37-f89ba8a25569"
        principal_id                           = "c0b9e7b9-3daf-4ab5-9cc5-b8d2b693740a"
        principal_type                         = "ServicePrincipal"
        role_definition_id                     = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c"
        role_definition_name                   = "Contributor"
        scope                                  = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9"
    }

  # module.rbac.azurerm_role_assignment.basic["10"] will be imported
    resource "azurerm_role_assignment" "basic" {
        condition                              = null
        condition_version                      = null
        delegated_managed_identity_resource_id = null
        description                            = null
        id                                     = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9/providers/Microsoft.Authorization/roleAssignments/a09d40a8-ffd8-40d9-8c00-497eadded773"
        name                                   = "a09d40a8-ffd8-40d9-8c00-497eadded773"
        principal_id                           = "425af35e-ea3b-4e60-8804-156684a08724"
        principal_type                         = "ServicePrincipal"
        role_definition_id                     = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c"
        role_definition_name                   = "Contributor"
        scope                                  = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9"
    }

  # module.rbac.azurerm_role_assignment.basic["11"] will be imported
    resource "azurerm_role_assignment" "basic" {
        condition                              = null
        condition_version                      = null
        delegated_managed_identity_resource_id = null
        description                            = null
        id                                     = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9/providers/Microsoft.Authorization/roleAssignments/4a04595b-3c6d-4ae0-a1f5-8de268ca73cf"
        name                                   = "4a04595b-3c6d-4ae0-a1f5-8de268ca73cf"
        principal_id                           = "a88c84a1-d418-4053-aa68-74a71cd6e36d"
        principal_type                         = "ServicePrincipal"
        role_definition_id                     = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c"
        role_definition_name                   = "Contributor"
        scope                                  = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9"
    }

  # module.rbac.azurerm_role_assignment.basic["12"] will be imported
    resource "azurerm_role_assignment" "basic" {
        condition                              = null
        condition_version                      = null
        delegated_managed_identity_resource_id = null
        description                            = null
        id                                     = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9/providers/Microsoft.Authorization/roleAssignments/b1b2a46f-6922-4f6f-904e-51acf1682f57"
        name                                   = "b1b2a46f-6922-4f6f-904e-51acf1682f57"
        principal_id                           = "2cdf794d-58ca-40ae-985a-a1031f08eccf"
        principal_type                         = "ServicePrincipal"
        role_definition_id                     = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c"
        role_definition_name                   = "Contributor"
        scope                                  = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9"
    }

  # module.rbac.azurerm_role_assignment.basic["13"] will be imported
    resource "azurerm_role_assignment" "basic" {
        condition                              = null
        condition_version                      = null
        delegated_managed_identity_resource_id = null
        description                            = null
        id                                     = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9/providers/Microsoft.Authorization/roleAssignments/083f4140-ea17-41cf-ac1a-8223503a529d"
        name                                   = "083f4140-ea17-41cf-ac1a-8223503a529d"
        principal_id                           = "ddb9988a-f168-4984-acc9-3868e79ce8c2"
        principal_type                         = "ServicePrincipal"
        role_definition_id                     = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c"
        role_definition_name                   = "Contributor"
        scope                                  = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9"
    }

  # module.rbac.azurerm_role_assignment.basic["14"] will be imported
    resource "azurerm_role_assignment" "basic" {
        condition                              = null
        condition_version                      = null
        delegated_managed_identity_resource_id = null
        description                            = null
        id                                     = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9/providers/Microsoft.Authorization/roleAssignments/d9dee46a-ecc5-46ee-ba42-dfc132ce4be0"
        name                                   = "d9dee46a-ecc5-46ee-ba42-dfc132ce4be0"
        principal_id                           = "7d4e78d1-480d-426e-a25e-162a8a83c762"
        principal_type                         = "Group"
        role_definition_id                     = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9/providers/Microsoft.Authorization/roleDefinitions/4d97b98b-1d4f-4787-a291-c67834d212e7"
        role_definition_name                   = "Network Contributor"
        scope                                  = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9"
    }

  # module.rbac.azurerm_role_assignment.basic["15"] will be imported
    resource "azurerm_role_assignment" "basic" {
        condition                              = null
        condition_version                      = null
        delegated_managed_identity_resource_id = null
        description                            = null
        id                                     = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9/providers/Microsoft.Authorization/roleAssignments/9a4b042f-603b-9129-bcb1-490e2ccd1336"
        name                                   = "9a4b042f-603b-9129-bcb1-490e2ccd1336"
        principal_id                           = "abdedfd3-12c4-4360-836b-ec78b791631b"
        principal_type                         = "User"
        role_definition_id                     = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c"
        role_definition_name                   = "Contributor"
        scope                                  = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9"
    }

  # module.rbac.azurerm_role_assignment.basic["16"] will be imported
    resource "azurerm_role_assignment" "basic" {
        condition                              = null
        condition_version                      = null
        delegated_managed_identity_resource_id = null
        description                            = null
        id                                     = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9/resourceGroups/rg-poc-ma/providers/Microsoft.Authorization/roleAssignments/e791a433-d373-454e-a480-5023c3107329"
        name                                   = "e791a433-d373-454e-a480-5023c3107329"
        principal_id                           = "6c68ee9d-7e3b-4e8c-9a0d-fbb5c918818c"
        principal_type                         = "User"
        role_definition_id                     = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9/providers/Microsoft.Authorization/roleDefinitions/4d97b98b-1d4f-4787-a291-c67834d212e7"
        role_definition_name                   = "Network Contributor"
        scope                                  = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9/resourceGroups/rg-poc-ma"
    }

  # module.rbac.azurerm_role_assignment.basic["17"] will be created
  + resource "azurerm_role_assignment" "basic" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6c68ee9d-7e3b-4e8c-9a0d-fbb5c918818c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9/resourceGroups/rg-poc-ma"
      + skip_service_principal_aad_check = false
    }

  # module.rbac.azurerm_role_assignment.basic["2"] will be imported
    resource "azurerm_role_assignment" "basic" {
        condition                              = null
        condition_version                      = null
        delegated_managed_identity_resource_id = null
        description                            = null
        id                                     = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9/resourceGroups/moaur-kv-test/providers/Microsoft.Authorization/roleAssignments/44c39f22-8a2d-4fba-ba06-a4b68fcec64c"
        name                                   = "44c39f22-8a2d-4fba-ba06-a4b68fcec64c"
        principal_id                           = "674ed51e-4af2-4a7b-b03d-438f9b9f6043"
        principal_type                         = "ServicePrincipal"
        role_definition_id                     = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9/providers/Microsoft.Authorization/roleDefinitions/8e3af657-a8ff-443c-a75c-2fe8c4bcb635"
        role_definition_name                   = "Owner"
        scope                                  = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9/resourceGroups/moaur-kv-test"
    }

  # module.rbac.azurerm_role_assignment.basic["3"] will be imported
    resource "azurerm_role_assignment" "basic" {
        condition                              = null
        condition_version                      = null
        delegated_managed_identity_resource_id = null
        description                            = null
        id                                     = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9/resourceGroups/moaur-kv-test/providers/Microsoft.KeyVault/vaults/moaur-kv/providers/Microsoft.Authorization/roleAssignments/e52668fe-0240-4382-b94e-dc6002340f3b"
        name                                   = "e52668fe-0240-4382-b94e-dc6002340f3b"
        principal_id                           = "4afbe840-6f29-4b44-ae68-f49c2eb6af62"
        principal_type                         = "User"
        role_definition_id                     = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9/providers/Microsoft.Authorization/roleDefinitions/b86a8fe4-44ce-4948-aee5-eccb2c155cd7"
        role_definition_name                   = "Key Vault Secrets Officer"
        scope                                  = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9/resourceGroups/moaur-kv-test/providers/Microsoft.KeyVault/vaults/moaur-kv"
    }

  # module.rbac.azurerm_role_assignment.basic["4"] must be replaced
  # (imported from "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9/providers/Microsoft.Authorization/roleAssignments/d9db612b-0fd2-4f93-9c29-0301d526d815")
  # Warning: this will destroy the imported resource
-/+ resource "azurerm_role_assignment" "basic" {
        condition                              = null
      + condition_version                      = (known after apply)
        delegated_managed_identity_resource_id = null
      - description                            = "The Classic Admin role was converted to an Azure Owner role on behalf of the user due to Classic Admin retirement." -> null # forces replacement
      ~ id                                     = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9/providers/Microsoft.Authorization/roleAssignments/d9db612b-0fd2-4f93-9c29-0301d526d815" -> (known after apply)
      ~ name                                   = "d9db612b-0fd2-4f93-9c29-0301d526d815" -> (known after apply)
        principal_id                           = "4afbe840-6f29-4b44-ae68-f49c2eb6af62"
      ~ principal_type                         = "User" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9/providers/Microsoft.Authorization/roleDefinitions/8e3af657-a8ff-443c-a75c-2fe8c4bcb635" -> (known after apply)
        role_definition_name                   = "Owner"
        scope                                  = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9"
      + skip_service_principal_aad_check       = false
    }

  # module.rbac.azurerm_role_assignment.basic["5"] will be imported
    resource "azurerm_role_assignment" "basic" {
        condition                              = null
        condition_version                      = null
        delegated_managed_identity_resource_id = null
        description                            = null
        id                                     = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9/providers/Microsoft.Authorization/roleAssignments/be0fc704-9d9f-4268-98a6-75d450c65dee"
        name                                   = "be0fc704-9d9f-4268-98a6-75d450c65dee"
        principal_id                           = "de235b19-6752-453a-b983-fd2ee4258df8"
        principal_type                         = "ServicePrincipal"
        role_definition_id                     = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9/providers/Microsoft.Authorization/roleDefinitions/18d7d88d-d35e-4fb5-a5c3-7773c20a72d9"
        role_definition_name                   = "User Access Administrator"
        scope                                  = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9"
    }

  # module.rbac.azurerm_role_assignment.basic["6"] will be imported
    resource "azurerm_role_assignment" "basic" {
        condition                              = null
        condition_version                      = null
        delegated_managed_identity_resource_id = null
        description                            = null
        id                                     = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9/providers/Microsoft.Authorization/roleAssignments/33180f66-6030-4731-8cdd-de3405e5b6cf"
        name                                   = "33180f66-6030-4731-8cdd-de3405e5b6cf"
        principal_id                           = "de235b19-6752-453a-b983-fd2ee4258df8"
        principal_type                         = "ServicePrincipal"
        role_definition_id                     = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9/providers/Microsoft.Authorization/roleDefinitions/acdd72a7-3385-48ef-bd42-f606fba81ae7"
        role_definition_name                   = "Reader"
        scope                                  = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9"
    }

  # module.rbac.azurerm_role_assignment.basic["7"] will be imported
    resource "azurerm_role_assignment" "basic" {
        condition                              = null
        condition_version                      = null
        delegated_managed_identity_resource_id = null
        description                            = null
        id                                     = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9/resourceGroups/rg-terraform-state/providers/Microsoft.Storage/storageAccounts/tfstatewe1878/providers/Microsoft.Authorization/roleAssignments/75334a5b-4f05-43ee-a8d1-792677dc69b8"
        name                                   = "75334a5b-4f05-43ee-a8d1-792677dc69b8"
        principal_id                           = "de235b19-6752-453a-b983-fd2ee4258df8"
        principal_type                         = "ServicePrincipal"
        role_definition_id                     = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe"
        role_definition_name                   = "Storage Blob Data Contributor"
        scope                                  = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9/resourceGroups/rg-terraform-state/providers/Microsoft.Storage/storageAccounts/tfstatewe1878"
    }

  # module.rbac.azurerm_role_assignment.basic["8"] will be imported
    resource "azurerm_role_assignment" "basic" {
        condition                              = null
        condition_version                      = null
        delegated_managed_identity_resource_id = null
        description                            = null
        id                                     = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9/providers/Microsoft.Authorization/roleAssignments/a8c20247-58a9-4ca5-908d-01d62a820329"
        name                                   = "a8c20247-58a9-4ca5-908d-01d62a820329"
        principal_id                           = "e394e6af-5ca3-4a84-8339-9ba4a679b53e"
        principal_type                         = "ServicePrincipal"
        role_definition_id                     = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c"
        role_definition_name                   = "Contributor"
        scope                                  = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9"
    }

  # module.rbac.azurerm_role_assignment.basic["9"] will be imported
    resource "azurerm_role_assignment" "basic" {
        condition                              = null
        condition_version                      = null
        delegated_managed_identity_resource_id = null
        description                            = null
        id                                     = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9/providers/Microsoft.Authorization/roleAssignments/1dded50a-4a17-4f79-a9b6-ee927a902b5a"
        name                                   = "1dded50a-4a17-4f79-a9b6-ee927a902b5a"
        principal_id                           = "19d50324-d61b-4a54-af2c-4fe88cdb90df"
        principal_type                         = "ServicePrincipal"
        role_definition_id                     = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c"
        role_definition_name                   = "Contributor"
        scope                                  = "/subscriptions/8af1cae0-0e3c-4e1d-9c0c-5bf6d1e0a4c9"
    }

Plan: 17 to import, 2 to add, 0 to change, 1 to destroy.

```

</details>

*Triggered by @MortenAurs on `test-new-role-assignment`*